Catalogs/DiscountCardKinds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>DiscountCardKinds</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Discount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountKindForDiscountCards</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountKindsForDiscountCards</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CardType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CardsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountsShortContent</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ThisIsMembershipCard</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PeriodKind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PeriodKindsForProgressiveDiscounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Periodicity</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Periodicity</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Comment>Any additional information</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountCardTemplate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountCardsTemplates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ProgressiveDiscountLimits</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>LowerBound</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Discount</Name>
							<Comment>Could be worthfull to make a percentage discount</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/DiscountKindsForDiscountCards.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>DiscountKindsForDiscountCards</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FixedDiscount</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ProgressiveDiscount</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/PeriodKindsForProgressiveDiscounts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>PeriodKindsForProgressiveDiscounts</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Current</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Past</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Last</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EntirePeriod</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/DiscountCardKinds/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region PredeterminedProceduresEventsHandlers

// Procedure - BeforeWrite event handler.
//
Procedure BeforeWrite(Cancel)
	
	If DiscountKindForDiscountCards = Enums.DiscountKindsForDiscountCards.FixedDiscount Then
		DiscountsShortContent = "" + Discount + "%";
		PeriodKind = Enums.PeriodKindsForProgressiveDiscounts.EmptyRef();
		Periodicity = Enums.Periodicity.EmptyRef();
	Else
		FirstPass = True;
		CurContent = "";
		For Each CurRow IN ProgressiveDiscountLimits Do
		
			If FirstPass Then
				FirstPass = False;
			Else
				CurContent = CurContent + "; ";
			EndIf;
			CurContent = CurContent + CurRow.LowerBound + " - " + CurRow.Discount + "%";
		
		EndDo;
		
		DiscountsShortContent = CurContent;
		
		If PeriodKind = Enums.PeriodKindsForProgressiveDiscounts.EntirePeriod Then
			Periodicity = Enums.Periodicity.EmptyRef();
		EndIf;
	EndIf;
	
EndProcedure

// Procedure - FillCheckProcessing event handler.
//
Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If DiscountKindForDiscountCards <> Enums.DiscountKindsForDiscountCards.ProgressiveDiscount OR PeriodKind = Enums.PeriodKindsForProgressiveDiscounts.EntirePeriod Then
		CheckedAttributes.Delete(CheckedAttributes.Find("Periodicity"));
	EndIf;
	
	If DiscountKindForDiscountCards <> Enums.DiscountKindsForDiscountCards.ProgressiveDiscount Then
		CheckedAttributes.Delete(CheckedAttributes.Find("PeriodKind"));
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
